        //-------------------------------------------------------------------------*
// 文件名: KBI_I.h                                                         *
// 说  明: KBI_I构件头文件                                                 *
//-------------------------------------------------------------------------*
 
#ifndef KBI_I_H
#define KBI_I_H

//头文件包含，及宏定义区

    //头文件包含
    #include    "GPIO.h"         //普通IO口构件头文件

    //接线说明：PTP0~3键盘4根列线(允许中断输入),PTA3-0接键盘4根行线(扫描线)
    //键盘控制引脚定义 
    #define KB_A                       PH            //PA口
    #define KB_P                       PH            //PTP口
    
    #define EnableKBint()              PIEH |= 0x0F  //开放键盘(PTP0~3)中断
    #define DisableKBint()             PIEH &= ~0x0F //屏蔽键盘(PTP0~3)中断
  
//构件函数声明区

    //---------------------------------------------------------------------*
    //函数名: KBInit                                                       *
    //功  能: 初始化键盘模块。                                             *
    //参  数: 无                                                           *
    //返  回: 无                                                           *
    //说  明: 无                                                           *
    //---------------------------------------------------------------------*
    void  KBInit(void);          

    //---------------------------------------------------------------------*
    //函数名: KBScan1                                                      *
    //功  能: 扫描1次4*4键盘,返回读取的键值                                *
    //参  数: 无                                                           *
    //返  回: 返回读取的键值                                               *
    //说  明: 无                                                           *
    //---------------------------------------------------------------------*
    uint8 KBScan1(void);  
    
    //---------------------------------------------------------------------*
    //函数名: KBDef                                                        *
    //功  能: 键值转为定义值                                               *
    //参  数: uint8 value: 键值                                            *
    //返  回: 键定义值                                                     *
    //说  明: 无                                                           *
    //---------------------------------------------------------------------*
    uint8 KBDef(uint8 valve);  
    
    //---------------------------------------------------------------------*
    //函数名: KBScanN                                                      *
    //功  能:N次扫描键盘,消除"抖动"问题                                    *
    //参  数: uint8 N：扫描键盘的次数                                      *
    //返  回:多次扫描键盘得到的键值                                        *
    //说  明:无                                                            *
    //---------------------------------------------------------------------*
    uint8 KBScanN(uint8 N);     
    
#endif     

