//--------------------------------------------------------------------------*
// 文件名: Light.h                                                          *
// 说  明: 指示灯驱动程序头文件                                             *
//--------------------------------------------------------------------------*

#ifndef Light_H     //避免重复相同的文件          
#define Light_H
//===========================================================================

//头文件包含区
    #include    "GPIO.h"         //普通IO口构件头文件
//宏定义区
        
    //1.灯状态宏定义(根据实际电路定义) 
    #define Light_ON        1    //灯亮(对应高电平)
    #define Light_OFF       0    //灯暗(对应低电平)
    
    //2.灯控制引脚定义
    #define Light_Run_PORT  PA   //Run(运行指示)灯使用的端口
    #define Light_Run       1    //Run(运行指示)灯使用的引脚


//构件函数声明区

//--------------------------------------------------------------------------*
//函数名: Light_Init                                                        *
//功  能: 初始化指示灯状态                                                  *
//参  数: port:端口名;                                                      * 
//        name:指定端口引脚号;                                              *
//        state:初始状态,1=高电平,0=低电平                                  *
//返  回: 无                                                                * 
//--------------------------------------------------------------------------*
void Light_Init(uint16 port,uint8 name,uint8 state);   

//--------------------------------------------------------------------------* 
//函数名: Light_Control                                                     *
//功  能: 控制灯的亮和暗                                                    *
//参  数: port:端口名;                                                      *
//        name:指定端口引脚号;                                              *
//        state:状态,1=高电平,0=低电平                                      *
//返  回: 无                                                                * 
//--------------------------------------------------------------------------*   
void Light_Control(uint16 port,uint8 name,uint8 state);

//--------------------------------------------------------------------------* 
//函数名: Light_Change                                                      *
//功  能: 状态切换，原来[暗]，则变[亮]；原来[亮]，则变[暗]                  *
//参  数: port:端口名;                                                      *
//        name:指定端口引脚号;                                              *
//返  回: 无                                                                * 
//--------------------------------------------------------------------------*   
void Light_Change(uint16 port,uint8 name);
    
//===========================================================================
#endif