//--------------------------------------------------------------------------*
//文件名:  Light.c (小灯驱动函数文件)                                       *
//--------------------------------------------------------------------------*

#include "Light.h"         //指示灯驱动程序头文件

//--------------------------------------------------------------------------*
//函数名: Light_Init                                                        *
//功  能: 初始化指示灯状态                                                  *
//参  数: port:端口名;                                                      * 
//        name:指定端口引脚号;                                              *
//        state:初始状态,1=高电平,0=低电平                                  *
//返  回: 无                                                                * 
//--------------------------------------------------------------------------*
void Light_Init(uint16 port,uint8 name,uint8 state)   
{
   GPIO_Init(port,name,1,state);    //初始化指示灯
}

//--------------------------------------------------------------------------* 
//函数名: Light_Control                                                     *
//功  能: 控制灯的亮和暗                                                    *
//参  数: port:端口名;                                                      *
//        name:指定端口引脚号;                                              *
//        state:状态,1=高电平,0=低电平                                      *
//返  回: 无                                                                * 
//--------------------------------------------------------------------------*   
void Light_Control(uint16 port,uint8 name,uint8 state)
{
    GPIO_Set(port,PRT,name,state);   //控制引脚状态     
} 

//--------------------------------------------------------------------------* 
//函数名: Light_Change                                                      *
//功  能: 状态切换，原来[暗]，则变[亮]；原来[亮]，则变[暗]                  *
//参  数: port:端口名;                                                      *
//        name:指定端口引脚号;                                              *
//返  回: 无                                                                * 
//--------------------------------------------------------------------------*   
void Light_Change(uint16 port,uint8 name)
{
   if(GPIO_Get(port,PRT,name)==Light_ON)   //若原来为"亮",则变"暗"
     GPIO_Set(port,PRT,name,Light_OFF);
   else                                    //若原来为"暗",则变"亮"
     GPIO_Set(port,PRT,name,Light_ON);
}

