 //--------------------------------------------------------------------------*
//文件名 : Timer.h                                                          *
//说  明 : (1)该头文件为Timer构件的头文件                                   *
//         (2)在需要用到Timer的地方，直接 Include "Timer.h"                 *
//         (3)为了避免重复包含相同的文件，使用                              *
//             #ifndef...#define...#endinf句法                              *
//--------------------------------------------------------------------------*

#ifndef TIMER_H
#define TIMER_H

    //头文件包含，及宏定义区

    // 头文件包含
    #include "Includes.h"                   //总头文件

    //开放或禁止定时器溢出中断 
    #define EnableTimer                TSCR2 |=  1<<7   //开放定时器溢出中断
    #define DisableTimer               TSCR2 &= ~(1<<7) //禁止定时器溢出中断


    //构件函数声明区

    //TimerInit:定时器初始化函数--------------------------------------------*
    //功  能:定时器初始化，中断一次时间为1/38秒                             *
    //参  数:无                                                             *
    //返  回:无                                                             *
    //----------------------------------------------------------------------*
    void TimerInit(void);        

    //----------------------------------------------------------------------*
    //函数名: calculate(计时函数)                                             *
    //功  能: 以秒为最小单位递增时,分,秒缓冲区的值(00:00:00-23:59:59)       *
    //参  数: *p:计数变量的首地址                                           *
    //返  回: 无                                                            *
    //----------------------------------------------------------------------*
    void calculate(uint8 *p);

#endif