//--------------------------------------------------------------------------*
//文件名 : Timer.c                                                          *
//说  明 : 该头文件为Timer模块初始化及功能函数实现文件                      *
//        (1)TimerInit:定时器初始化                                         *
//        (2)TimerUpDate:定时器更新                                         *
//--------------------------------------------------------------------------*
    //头文件包含，及宏定义区
 
    //头文件包含
    #include         "Timer.h"                  //定时器构件头文件


    //构件函数实现

    //TimerInit:定时器初始化函数--------------------------------------------*
    //功  能:定时器初始化，中断一次时间为1/38秒                             *
    //参  数:无                                                             *
    //返  回:无                                                             *
    //----------------------------------------------------------------------*
    void TimerInit(void)
    {
        //允许主定时器开始计数 
        TSCR1 = 0x80;  
        //禁止定时器溢出中断,中断一次时间计算：t=n/(fbus/p)≈1/4秒,
        //其中n=65535,fbus=32MHZ
        TSCR2 = 0b00000111;
        //             |||_
        //             ||__\分频因子为2^7=128
        //             |___/
    }

    //----------------------------------------------------------------------*
    //函数名: calculate(计时函数)                                             *
    //功  能: 以秒为最小单位递增时,分,秒缓冲区的值(00:00:00-23:59:59)       *
    //参  数: *p:计数变量的首地址                                           *
    //返  回: 无                                                            *
    //----------------------------------------------------------------------*
    void calculate(uint8 *p)
    {
         *(p+2) += 1;                                       //秒加1
        if (*(p+2) >= 60)                                  //秒溢出
        {
            *(p+2)  = 0;                                   //清秒
            *(p+1) += 1;                                   //分加1
            if (*(p+1) >= 60)                              //分溢出
            {
                *(p+1)  = 0;                               //清时
                *p += 1;                                   //时加1
                if (*p >= 24)                              //时溢出
                    *p = 0;                                //清时
            }
        }      
    }

